crd-ws-deploy/crda-impl/src/test/resources/data/FullASmt/tmp_UC_FULL_AUTO.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-2109075379"><ent:performCreditAssessment xmlns:ent="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/EnterpriseCreditAssessmentServiceRequestResponse_v2"><ent:creditAssessmentRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ent:FullCreditAssessmentRequest"><ent:creditAssessmentTypeCd>FULL_ASSESSMENT</ent:creditAssessmentTypeCd><ent:creditAssessmentSubTypeCd>AUTO_ASSESSMENT</ent:creditAssessmentSubTypeCd><ent:customerID>99605681</ent:customerID><ent:applicationID>6102</ent:applicationID><ent:channelID>DESKTOP</ent:channelID><ent:lineOfBusiness>WIRELINE</ent:lineOfBusiness><ent:creditCustomerInfo><cred:customerID xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">99605681</cred:customerID><cred:personName xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><cred:firstName>CREDIT</cred:firstName><cred:lastName>UATESTC</cred:lastName></cred:personName><cred:customerCreationDate xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">2019-07-21</cred:customerCreationDate><cred:customerMasterSourceID xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">1012</cred:customerMasterSourceID><cred:customerStatusCd xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">AC</cred:customerStatusCd><cred:customerTypeCd xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">R</cred:customerTypeCd><cred:customerSubTypeCd xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">I</cred:customerSubTypeCd><cred:revenueSegmentCd xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">N</cred:revenueSegmentCd><cred:employeeInd xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">false</cred:employeeInd></ent:creditCustomerInfo><ent:creditProfileData><cred:creditProfileID xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">4725558554</cred:creditProfileID><cred:customerID xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">99605681</cred:customerID><cred:creditIdentification xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"/><cred:creditAddress xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><cred:creditAddressTypeCd>CB</cred:creditAddressTypeCd><cred:addressTypeCd>CB</cred:addressTypeCd><cred:addressLineOne>3030 2 avenue </cred:addressLineOne><cred:cityName>calgary</cred:cityName><cred:provinceCd>AB</cred:provinceCd><cred:countryCd>CAN</cred:countryCd><cred:postalCd>T2A5N7</cred:postalCd></cred:creditAddress><cred:applicationProvinceCd xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">AB</cred:applicationProvinceCd><cred:personalInfo xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><cred:employmentStatusCd>EM</cred:employmentStatusCd><cred:residencyCd>O</cred:residencyCd><cred:creditCheckConsentCd>Y</cred:creditCheckConsentCd><cred:birthDate>1975-03-16</cred:birthDate><cred:underLegalCareCd>N</cred:underLegalCareCd><cred:provinceOfCurrentResidenceCd>AB</cred:provinceOfCurrentResidenceCd></cred:personalInfo><cred:creditCardCd xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><cred:primaryCreditCardCd>NA</cred:primaryCreditCardCd><cred:secondaryCreditCardCd>NA</cred:secondaryCreditCardCd></cred:creditCardCd><cred:creditProfileStatusCd xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">A</cred:creditProfileStatusCd><cred:businessLastUpdateTimestamp xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">2019-07-21T13:25:45.521Z</cred:businessLastUpdateTimestamp><cred:bypassMatchIndicator xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">false</cred:bypassMatchIndicator><cred:formatCd xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">P</cred:formatCd><cred:methodCd xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">OO</cred:methodCd><cred:commentTxt xmlns:cred="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">Default - Credit Assessment Not Complete</cred:commentTxt><wir:creditWorthiness xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wir="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/WirelineCreditProfileManagementTypes_v2"><wir:customerID>99605681</wir:customerID><wir:creditValueCd>R</wir:creditValueCd><wir:creditRiskLevel>9000</wir:creditRiskLevel><wir:assessmentMessageCd>REGCA03</wir:assessmentMessageCd><wir:productCategoryQualification><ns4:productCategoryList xmlns:ns10="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/types/ping_v1" xmlns:ns2="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/WLNCreditProfileManagementServiceRequestResponse_v2" xmlns:ns3="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/EnterpriseCommonTypes_v6" xmlns:ns4="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:ns5="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/WirelineCreditProfileManagementTypes_v2" xmlns:ns6="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/CustomerManagementCommonTypes_v4" xmlns:ns7="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/customer_information_reference_types_1_0" xmlns:ns8="http://schemas.telus.com/eca/common_types_2_1" xmlns:ns9="http://xmlschema.tmi.telus.com/xsd/common/exceptions/Exceptions_v1_0"><ns4:categoryCd>SLR</ns4:categoryCd><ns4:qualified>true</ns4:qualified></ns4:productCategoryList><ns4:boltOnInd xmlns:ns10="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/types/ping_v1" xmlns:ns2="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/WLNCreditProfileManagementServiceRequestResponse_v2" xmlns:ns3="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/EnterpriseCommonTypes_v6" xmlns:ns4="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:ns5="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/WirelineCreditProfileManagementTypes_v2" xmlns:ns6="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/CustomerManagementCommonTypes_v4" xmlns:ns7="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/customer_information_reference_types_1_0" xmlns:ns8="http://schemas.telus.com/eca/common_types_2_1" xmlns:ns9="http://xmlschema.tmi.telus.com/xsd/common/exceptions/Exceptions_v1_0">false</ns4:boltOnInd></wir:productCategoryQualification><wir:decisionCd>DFLTR0000001</wir:decisionCd></wir:creditWorthiness><wir:reportIndicator xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wir="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/WirelineCreditProfileManagementTypes_v2">false</wir:reportIndicator><wir:creditValueEffectiveDate xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wir="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/WirelineCreditProfileManagementTypes_v2">2019-07-21T13:25:45Z</wir:creditValueEffectiveDate></ent:creditProfileData><ent:unifiedCreditSearchResult xsi:type="ent:WlsUnifiedCreditSearchResult"><ent:matchFound xmlns:gucacdsj="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/GetUCAdditionalCustomerDataSplitJoinRequestResponse" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><ent:indicator>true</ent:indicator><ent:reasonCd>UC_MTCH_RSN_013</ent:reasonCd></ent:matchFound><ent:dataInquiryErrorCodeList xmlns:gucacdsj="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/GetUCAdditionalCustomerDataSplitJoinRequestResponse" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"/><ent:lineOfBusiness xmlns:gucacdsj="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/GetUCAdditionalCustomerDataSplitJoinRequestResponse" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">WIRELESS</ent:lineOfBusiness><ent:unifiedCreditDormantInd xmlns:gucacdsj="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/GetUCAdditionalCustomerDataSplitJoinRequestResponse" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">false</ent:unifiedCreditDormantInd><ent:matchedAccount xmlns:gucacdsj="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/GetUCAdditionalCustomerDataSplitJoinRequestResponse" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><ent:accountData><ent:billingAccountNumber>35019712</ent:billingAccountNumber><ent:accountType>I</ent:accountType><ent:accountSubType>R</ent:accountSubType><ent:brandId>3</ent:brandId><ent:accountCreationDate>2018-11-09T00:00:00Z</ent:accountCreationDate><ent:accountStatus>T</ent:accountStatus><ent:accountStatusDate>2018-11-09T00:00:00Z</ent:accountStatusDate><ent:statusActivityCode>TEN</ent:statusActivityCode><ent:statusActivityReasonCode>NB  </ent:statusActivityReasonCode></ent:accountData><ent:creditWorthinessData><ent:riskLevelNumber>600</ent:riskLevelNumber><ent:riskLevelDecisionCd>KOVERRK000022</ent:riskLevelDecisionCd><ent:creditClassCd>D</ent:creditClassCd></ent:creditWorthinessData><ent:warningHistoryList><ent:warningCategoryCd>BLF</ent:warningCategoryCd><ent:warningCd>W</ent:warningCd><ent:warningTypeCd/><ent:warningStatusCd>INACTIVE</ent:warningStatusCd></ent:warningHistoryList><ent:warningHistoryList><ent:warningCategoryCd>BLF</ent:warningCategoryCd><ent:warningCd>W</ent:warningCd><ent:warningTypeCd/><ent:warningStatusCd>INACTIVE</ent:warningStatusCd></ent:warningHistoryList><ent:warningHistoryList><ent:warningCategoryCd>IDF</ent:warningCategoryCd><ent:warningCd>IDENTITY_FRAUD_01</ent:warningCd><ent:warningTypeCd/><ent:warningStatusCd>UNVERIFIED</ent:warningStatusCd></ent:warningHistoryList><ent:warningHistoryList><ent:warningCategoryCd>SEW</ent:warningCategoryCd><ent:warningCd>CREDIT_CLASS_K</ent:warningCd><ent:warningTypeCd/><ent:warningStatusCd>IRRESOLVABLE</ent:warningStatusCd></ent:warningHistoryList><ent:warningHistoryList><ent:warningCategoryCd>BLF</ent:warningCategoryCd><ent:warningCd>W</ent:warningCd><ent:warningTypeCd/><ent:warningStatusCd>UNVERIFIED</ent:warningStatusCd></ent:warningHistoryList><ent:warningHistoryList><ent:warningCategoryCd>IDF</ent:warningCategoryCd><ent:warningCd>IDENTITY_FRAUD_01</ent:warningCd><ent:warningTypeCd/><ent:warningStatusCd>UNVERIFIED</ent:warningStatusCd></ent:warningHistoryList><ent:accountFinancialHistory><ent:delinquentInd>false</ent:delinquentInd></ent:accountFinancialHistory><ent:creditBureauResult/><ent:totalSubscribers><ent:totalActiveSubscribersNumber>0</ent:totalActiveSubscribersNumber><ent:totalReservedSubscribersNumber>0</ent:totalReservedSubscribersNumber><ent:totalSuspendedSubscribersNumber>0</ent:totalSuspendedSubscribersNumber></ent:totalSubscribers></ent:matchedAccount></ent:unifiedCreditSearchResult></ent:creditAssessmentRequest><ent:auditInfo><ns5:userId xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns10="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/CustomerManagementCommonTypes_v4" xmlns:ns11="http://xmlschema.tmi.telus.com/xsd/Product/Product/ProductCatalogueInfoSvcTypes_v4" xmlns:ns12="http://xmlschema.tmi.telus.com/xsd/common/exceptions/Exceptions_v1_0" xmlns:ns2="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/WLNCreditProfileManagementProxyServiceRequestResponse_v2" xmlns:ns3="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:ns4="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/WirelineCreditProfileManagementTypes_v2" xmlns:ns5="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/EnterpriseCommonTypes_v7" xmlns:ns6="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/Exceptions_v3" xmlns:ns7="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/types/ping_v1" xmlns:ns8="http://schemas.telus.com/eca/common_types_2_1" xmlns:ns9="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/customer_information_reference_types_1_0">t852256</ns5:userId><ns5:originatorApplicationId xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns10="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/CustomerManagementCommonTypes_v4" xmlns:ns11="http://xmlschema.tmi.telus.com/xsd/Product/Product/ProductCatalogueInfoSvcTypes_v4" xmlns:ns12="http://xmlschema.tmi.telus.com/xsd/common/exceptions/Exceptions_v1_0" xmlns:ns2="http://xmlschema.tmi.telus.com/srv/CMO/OrderMgmt/WLNCreditProfileManagementProxyServiceRequestResponse_v2" xmlns:ns3="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/CreditCommon_v1" xmlns:ns4="http://xmlschema.tmi.telus.com/xsd/Customer/Customer/WirelineCreditProfileManagementTypes_v2" xmlns:ns5="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/EnterpriseCommonTypes_v7" xmlns:ns6="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/Exceptions_v3" xmlns:ns7="http://xmlschema.tmi.telus.com/xsd/Enterprise/BaseTypes/types/ping_v1" xmlns:ns8="http://schemas.telus.com/eca/common_types_2_1" xmlns:ns9="http://xmlschema.tmi.telus.com/xsd/Customer/BaseTypes/customer_information_reference_types_1_0">6102</ns5:originatorApplicationId></ent:auditInfo></ent:performCreditAssessment></soapenv:Body></soapenv:Envelope>